# ReadXMLFile

## Description
Opens and reads an XML file.

```pascal
FUNCTION ReadXMLFile(
				XMLHandle : LONGINT;
				whichPath : INTEGER;
				filename  : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.ReadXMLFile(XMLHandle, whichPath, filename):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|whichPath|INTEGER||
|filename|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML